{
     "creationSource": null,
     "description": "Configures comprehensive screensaver security settings including idle time activation (10 minutes), password requirements, delay timing, and login window idle timeout to enhance device security when unattended.",
     "name": "[intune-my-macs] POL-SEC-005 - Screensaver Security",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 2,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "com.apple.screensaver_com.apple.screensaver",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.screensaver_askforpassword",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.screensaver_askforpassword_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.screensaver_askforpassworddelay",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 60
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.screensaver_loginwindowidletime",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 1200
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.screensaver_modulename",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "Flurry"
                                        }
                                   }
                              ]
                         }
                    ]
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "com.apple.screensaver.user_com.apple.screensaver.user",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.screensaver.user_idletime",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 600
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.screensaver.user_modulename",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "Flurry"
                                        }
                                   }
                              ]
                         }
                    ]
               }
          }
     ]
}