{
     "creationSource": null,
     "description": "",
     "name": "[intune-my-macs] POL-APP-100 - Microsoft Office Configuration",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 15,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_acknowledgeddatacollectionpolicy",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_acknowledgeddatacollectionpolicy_1",
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_updatedeadline.daysbeforeforcedquit",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "settingValueTemplateReference": null,
                         "value": 3
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_disableinsidercheckbox",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_disableinsidercheckbox_true",
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_howtocheck",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_howtocheck_0",
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_enablecheckforupdatesbutton",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_enablecheckforupdatesbutton_true",
                         "children": []
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_updatedeadline.finalcountdown",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "settingValueTemplateReference": null,
                         "value": 60
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_startdaemononapplaunch",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_startdaemononapplaunch_true",
                         "children": []
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_channelname",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_channelname_0",
                         "children": []
                    }
               }
          },
          {
               "id": "8",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_updatecheckfrequency",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "settingValueTemplateReference": null,
                         "value": 240
                    }
               }
          },
          {
               "id": "9",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_diagnosticdatatypepreference",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_diagnosticdatatypepreference_1",
                         "children": []
                    }
               }
          },
          {
               "id": "10",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_officeautosignin",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_officeautosignin_true",
                         "children": []
                    }
               }
          },
          {
               "id": "11",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_officeactivationemailaddress",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                         "settingValueTemplateReference": null,
                         "value": "{{mail}}"
                    }
               }
          },
          {
               "id": "12",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_defaultemailaddressordomain",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                         "settingValueTemplateReference": null,
                         "value": "{{mail}}"
                    }
               }
          },
          {
               "id": "13",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_enablenewoutlook",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_enablenewoutlook_3",
                         "children": []
                    }
               }
          },
          {
               "id": "14",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_userpreference_maxchecklistdisplaydurationmet",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_userpreference_maxchecklistdisplaydurationmet_true",
                         "children": []
                    }
               }
          }
     ]
}