{
     "creationSource": null,
     "description": "Enhanced basic browser configuration for Microsoft Edge addressing gap analysis findings (Certificate management, network policies, system integration)",
     "name": "[intune-my-macs] POL-APP-101 - Edge Browser Level 1 Basic",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 22,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_importautofillformdata",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_importautofillformdata_false",
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_importsavedpasswords",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_importsavedpasswords_false",
                         "children": []
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_personalizationreportingenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_personalizationreportingenabled_false",
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_quicallowed",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_quicallowed_false",
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_autoselectcertificateforurls",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingCollectionValue": [
                         {
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                              "settingValueTemplateReference": null,
                              "value": "*.arnab.fun"
                         }
                    ]
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_trackingprevention",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_trackingprevention_3",
                         "children": []
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_automatichttpsdefault",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_automatichttpsdefault_2",
                         "children": []
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_smartscreenenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_smartscreenenabled_true",
                         "children": []
                    }
               }
          },
          {
               "id": "8",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_homepagelocation",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                         "settingValueTemplateReference": null,
                         "value": "https://outlook.office.com"
                    }
               }
          },
          {
               "id": "9",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_newtabpagelocation",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                         "settingValueTemplateReference": null,
                         "value": "https://outlook.office.com"
                    }
               }
          },
          {
               "id": "10",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_defaultpopupssetting",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_defaultpopupssetting_1",
                         "children": []
                    }
               }
          },
          {
               "id": "11",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_dnsinterceptionchecksenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_dnsinterceptionchecksenabled_true",
                         "children": []
                    }
               }
          },
          {
               "id": "12",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_autofilladdressenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_autofilladdressenabled_false",
                         "children": []
                    }
               }
          },
          {
               "id": "13",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_autofillcreditcardenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_autofillcreditcardenabled_false",
                         "children": []
                    }
               }
          },
          {
               "id": "14",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_componentupdatesenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_componentupdatesenabled_true",
                         "children": []
                    }
               }
          },
          {
               "id": "15",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_networkpredictionoptions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_networkpredictionoptions_2",
                         "children": []
                    }
               }
          },
          {
               "id": "16",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_passwordmanagerenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_passwordmanagerenabled_false",
                         "children": []
                    }
               }
          },
          {
               "id": "17",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_searchsuggestenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_searchsuggestenabled_false",
                         "children": []
                    }
               }
          },
          {
               "id": "18",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_hidefirstrunexperience",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_hidefirstrunexperience_true",
                         "children": []
                    }
               }
          },
          {
               "id": "19",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_diagnosticdata",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_diagnosticdata_1",
                         "children": []
                    }
               }
          },
          {
               "id": "20",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_showhomebutton",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_showhomebutton_true",
                         "children": []
                    }
               }
          },
          {
               "id": "21",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_updatepolicyoverride",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "com.apple.managedclient.preferences_updatepolicyoverride_0",
                         "children": []
                    }
               }
          }
     ]
}