{
     "creationSource": null,
     "description": "Configures power management and energy saver settings for macOS devices. Sets display sleep to 5 minutes and system sleep to 10 minutes for both desktop (AC power) and portable devices. Enables Wake on LAN for desktop computers to allow network-based device management and remote wake capabilities.",
     "name": "[intune-my-macs] POL-SYS-102 - Power Management",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 1,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "com.apple.mcx_com.apple.mcx-energysaver",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.desktop.acpower",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.desktop.acpower_display sleep timer",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": 5
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.desktop.acpower_system sleep timer",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": 10
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.desktop.acpower_wake on lan",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.mcx_com.apple.energysaver.desktop.acpower_wake on lan_1",
                                                                 "children": []
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.portable.acpower",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.portable.acpower_display sleep timer",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": 5
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.mcx_com.apple.energysaver.portable.acpower_system sleep timer",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": 10
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   }
                              ]
                         }
                    ]
               }
          }
     ]
}