{
     "creationSource": null,
     "description": "Enforces passcode requirements for macOS devices including minimum length, complexity, failed attempt limits, and expiration policies to ensure device security compliance.",
     "name": "[intune-my-macs] POL-SYS-104 - DDM Passcode Configuration",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 1,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "passcode_passcode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "passcode_changeatnextauth",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "passcode_changeatnextauth_false",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_failedattemptsresetinminutes",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 0
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_maximumgraceperiodinminutes",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 0
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_maximumfailedattempts",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 11
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_maximumpasscodeageindays",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 365
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_minimumcomplexcharacters",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 1
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_minimumlength",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 6
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "passcode_passcodereuselimit",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 1
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "passcode_requirealphanumericpasscode",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "passcode_requirealphanumericpasscode_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "passcode_requirecomplexpasscode",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "passcode_requirecomplexpasscode_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "passcode_requirepasscode",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "passcode_requirepasscode_true",
                                             "children": []
                                        }
                                   }
                              ]
                         }
                    ]
               }
          }
     ]
}