{
     "creationSource": null,
     "description": "",
     "name": "[intune-my-macs] POL-SYS-103 - Software Update Policy",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 2,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "ddm-latestsoftwareupdate_ddm-latestsoftwareupdate",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "ddm-latestsoftwareupdate_enforcelatestsoftwareupdateversion_0",
                                             "children": [
                                                  {
                                                       "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                       "settingDefinitionId": "ddm-latestsoftwareupdate_delayindays",
                                                       "settingInstanceTemplateReference": null,
                                                       "auditRuleInformation": null,
                                                       "simpleSettingValue": {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                            "settingValueTemplateReference": null,
                                                            "value": 3
                                                       }
                                                  },
                                                  {
                                                       "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                       "settingDefinitionId": "ddm-latestsoftwareupdate_installtime",
                                                       "settingInstanceTemplateReference": null,
                                                       "auditRuleInformation": null,
                                                       "simpleSettingValue": {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                            "settingValueTemplateReference": null,
                                                            "value": "01:00"
                                                       }
                                                  }
                                             ]
                                        }
                                   }
                              ]
                         }
                    ]
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "softwareupdate_softwareupdate",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "softwareupdate_allowstandarduserosupdates",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "softwareupdate_allowstandarduserosupdates_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "softwareupdate_automaticactions",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "softwareupdate_automaticactions_download",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "softwareupdate_automaticactions_download_1",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "softwareupdate_automaticactions_installosupdates",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "softwareupdate_automaticactions_installosupdates_1",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "softwareupdate_automaticactions_installsecurityupdate",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "softwareupdate_automaticactions_installsecurityupdate_1",
                                                                 "children": []
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "softwareupdate_notifications",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "softwareupdate_notifications_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "softwareupdate_rapidsecurityresponse",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "softwareupdate_rapidsecurityresponse_enable",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "softwareupdate_rapidsecurityresponse_enable_true",
                                                                 "children": []
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   }
                              ]
                         }
                    ]
               }
          }
     ]
}