{
     "creationSource": null,
     "description": "",
     "name": "POC_MAC_D_CO_SBL_MSZT_SSO_Platform",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 1,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_authenticationmethod",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.extensiblesso_authenticationmethod_1",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_extensiondata",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "Enable_SSO_On_All_ManagedApps"
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_ignored_1",
                                                                 "children": [
                                                                      {
                                                                           "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                           "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_integer",
                                                                           "settingInstanceTemplateReference": null,
                                                                           "auditRuleInformation": null,
                                                                           "simpleSettingValue": {
                                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                "settingValueTemplateReference": null,
                                                                                "value": 1
                                                                           }
                                                                      }
                                                                 ]
                                                            }
                                                       }
                                                  ]
                                             },
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "disable_explicit_app_prompt"
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_ignored_1",
                                                                 "children": [
                                                                      {
                                                                           "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                           "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_integer",
                                                                           "settingInstanceTemplateReference": null,
                                                                           "auditRuleInformation": null,
                                                                           "simpleSettingValue": {
                                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                "settingValueTemplateReference": null,
                                                                                "value": 1
                                                                           }
                                                                      }
                                                                 ]
                                                            }
                                                       }
                                                  ]
                                             },
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "browser_sso_interaction_enabled"
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_ignored_1",
                                                                 "children": [
                                                                      {
                                                                           "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                           "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_integer",
                                                                           "settingInstanceTemplateReference": null,
                                                                           "auditRuleInformation": null,
                                                                           "simpleSettingValue": {
                                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                "settingValueTemplateReference": null,
                                                                                "value": 1
                                                                           }
                                                                      }
                                                                 ]
                                                            }
                                                       }
                                                  ]
                                             },
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_keytobereplaced",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "AppPrefixAllowList"
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_ignored_$typepicker",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_ignored_0",
                                                                 "children": [
                                                                      {
                                                                           "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                           "settingDefinitionId": "com.apple.extensiblesso_extensiondata_generickey_string",
                                                                           "settingInstanceTemplateReference": null,
                                                                           "auditRuleInformation": null,
                                                                           "simpleSettingValue": {
                                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                "settingValueTemplateReference": null,
                                                                                "value": "com.microsoft.,com.apple."
                                                                           }
                                                                      }
                                                                 ]
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_extensionidentifier",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "com.microsoft.CompanyPortalMac.ssoextension"
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_platformsso",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_accountdisplayname",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "CustomerDomain Account"
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_authenticationmethod",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_platformsso_authenticationmethod_1",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_enableauthorization",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_platformsso_enableauthorization_true",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_enablecreateuseratlogin",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_platformsso_enablecreateuseratlogin_true",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_loginfrequency",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": 64800
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_0",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_nonplatformssoaccounts",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingCollectionValue": [
                                                                 {
                                                                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                      "settingValueTemplateReference": null,
                                                                      "value": "BreakGlassAdmin"
                                                                 }
                                                            ]
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "groupSettingCollectionValue": [
                                                                 {
                                                                      "settingValueTemplateReference": null,
                                                                      "children": [
                                                                           {
                                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping_accountname",
                                                                                "settingInstanceTemplateReference": null,
                                                                                "auditRuleInformation": null,
                                                                                "simpleSettingValue": {
                                                                                     "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                     "settingValueTemplateReference": null,
                                                                                     "value": "preferred_username"
                                                                                }
                                                                           },
                                                                           {
                                                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_tokentousermapping_fullname",
                                                                                "settingInstanceTemplateReference": null,
                                                                                "auditRuleInformation": null,
                                                                                "simpleSettingValue": {
                                                                                     "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                     "settingValueTemplateReference": null,
                                                                                     "value": "name"
                                                                                }
                                                                           }
                                                                      ]
                                                                 }
                                                            ]
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_useshareddevicekeys",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_platformsso_useshareddevicekeys_true",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.extensiblesso_platformsso_userauthorizationmode",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.extensiblesso_platformsso_userauthorizationmode_0",
                                                                 "children": []
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_registrationtoken",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "{{DEVICEREGISTRATION}}"
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_screenlockedbehavior",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.extensiblesso_screenlockedbehavior_0",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_teamidentifier",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "UBF8T346G9"
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_type",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.extensiblesso_type_1",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                        "settingDefinitionId": "com.apple.extensiblesso_urls",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingCollectionValue": [
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                  "settingValueTemplateReference": null,
                                                  "value": "https://login.microsoftonline.com"
                                             },
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                  "settingValueTemplateReference": null,
                                                  "value": "https://login.microsoft.com"
                                             },
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                  "settingValueTemplateReference": null,
                                                  "value": "https://sts.windows.net"
                                             },
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                  "settingValueTemplateReference": null,
                                                  "value": "https://login-us.microsoftonline.com"
                                             },
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                  "settingValueTemplateReference": null,
                                                  "value": "https://login.microsoftonline.us"
                                             },
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                  "settingValueTemplateReference": null,
                                                  "value": "https://kerberos.microsoftonline.com"
                                             }
                                        ]
                                   }
                              ]
                         }
                    ]
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}