{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_MSZT_LocalGroupMembership",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 1,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "22968f54-45fa-486c-848e-f8224aa69772_1",
          "templateFamily": "endpointSecurityAccountProtection",
          "templateDisplayName": "Local user group membership",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "de06bec1-4852-48a0-9799-cf7b85992d45"
                    },
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
                                                            "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingCollectionValue": [
                                                                 {
                                                                      "settingValueTemplateReference": null,
                                                                      "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc_administrators",
                                                                      "children": []
                                                                 }
                                                            ]
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action_add_update",
                                                                 "children": []
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype_users",
                                                                 "children": [
                                                                      {
                                                                           "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                                           "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_users",
                                                                           "settingInstanceTemplateReference": null,
                                                                           "auditRuleInformation": null,
                                                                           "simpleSettingCollectionValue": [
                                                                                {
                                                                                     "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                     "settingValueTemplateReference": null,
                                                                                     "value": "AzureAD\\AdeleV@ennnnbeeee.onmicrosoft.com"
                                                                                }
                                                                           ]
                                                                      }
                                                                 ]
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   }
                              ]
                         }
                    ]
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}