{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_CIS_MS_InternetExplorer",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 111,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp_v2",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp_v2_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp_v2_notifydisableieoptions",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_disableinternetexplorerapp_v2_notifydisableieoptions_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_allowsoftwarewhensignatureisinvalid",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_allowsoftwarewhensignatureisinvalid_0",
                         "children": []
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_checkservercertificaterevocation",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_checkservercertificaterevocation_1",
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_checksignaturesondownloadedprograms",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_checksignaturesondownloadedprograms_1",
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_donotallowactivexcontrolsinprotectedmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_donotallowactivexcontrolsinprotectedmode_1",
                         "children": []
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_disableencryptionsupport_advanced_wininetprotocoloptions_2560",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableprocessesinenhancedprotectedmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_disableprocessesinenhancedprotectedmode_1",
                         "children": []
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_allowenhancedprotectedmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_allowenhancedprotectedmode_1",
                         "children": []
                    }
               }
          },
          {
               "id": "8",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disableignoringcertificateerrors",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_disableignoringcertificateerrors_1",
                         "children": []
                    }
               }
          },
          {
               "id": "9",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowaccesstodatasources",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowaccesstodatasources_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowaccesstodatasources_iz_partname1406",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowaccesstodatasources_iz_partname1406_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "10",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowcopypasteviascript",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowcopypasteviascript_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowcopypasteviascript_iz_partname1407",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowcopypasteviascript_iz_partname1407_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "11",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowdraganddropcopyandpastefiles",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowdraganddropcopyandpastefiles_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowdraganddropcopyandpastefiles_iz_partname1802",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowdraganddropcopyandpastefiles_iz_partname1802_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "12",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowloadingofxamlfiles",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowloadingofxamlfiles_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowloadingofxamlfiles_iz_partname2402",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowloadingofxamlfiles_iz_partname2402_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "13",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstouseactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstouseactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstouseactivexcontrols_iz_partname120b",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstouseactivexcontrols_iz_partname120b_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "14",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstousetdcactivexcontrol",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstousetdcactivexcontrol_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstousetdcactivexcontrol_iz_partname120c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowonlyapproveddomainstousetdcactivexcontrol_iz_partname120c_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "15",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptinitiatedwindows",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptinitiatedwindows_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptinitiatedwindows_iz_partname2102",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptinitiatedwindows_iz_partname2102_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "16",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptingofinternetexplorerwebbrowsercontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptingofinternetexplorerwebbrowsercontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptingofinternetexplorerwebbrowsercontrols_iz_partname1206",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptingofinternetexplorerwebbrowsercontrols_iz_partname1206_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "17",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptlets",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptlets_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptlets_iz_partname1209",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowscriptlets_iz_partname1209_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "18",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowupdatestostatusbarviascript",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowupdatestostatusbarviascript_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowupdatestostatusbarviascript_iz_partname2103",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowupdatestostatusbarviascript_iz_partname2103_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "19",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowvbscripttorunininternetexplorer",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowvbscripttorunininternetexplorer_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowvbscripttorunininternetexplorer_iz_partname140c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowvbscripttorunininternetexplorer_iz_partname140c_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "20",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowautomaticpromptingforfiledownloads",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowautomaticpromptingforfiledownloads_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowautomaticpromptingforfiledownloads_iz_partname2200",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowautomaticpromptingforfiledownloads_iz_partname2200_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "21",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonedonotrunantimalwareagainstactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonedonotrunantimalwareagainstactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonedonotrunantimalwareagainstactivexcontrols_iz_partname270c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonedonotrunantimalwareagainstactivexcontrols_iz_partname270c_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "22",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadsignedactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadsignedactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadsignedactivexcontrols_iz_partname1001",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadsignedactivexcontrols_iz_partname1001_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "23",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadunsignedactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadunsignedactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadunsignedactivexcontrols_iz_partname1004",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonedownloadunsignedactivexcontrols_iz_partname1004_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "24",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainsacrosswindows",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainsacrosswindows_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainsacrosswindows_iz_partname2709",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainsacrosswindows_iz_partname2709_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "25",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainswithinwindows",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainswithinwindows_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainswithinwindows_iz_partname2708",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenabledraggingofcontentfromdifferentdomainswithinwindows_iz_partname2708_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "26",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneincludelocalpathwhenuploadingfilestoserver",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneincludelocalpathwhenuploadingfilestoserver_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneincludelocalpathwhenuploadingfilestoserver_iz_partname160a",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneincludelocalpathwhenuploadingfilestoserver_iz_partname160a_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "27",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneinitializeandscriptactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneinitializeandscriptactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneinitializeandscriptactivexcontrols_iz_partname1201",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneinitializeandscriptactivexcontrols_iz_partname1201_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "28",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonejavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "29",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonelaunchingapplicationsandfilesiniframe",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonelaunchingapplicationsandfilesiniframe_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonelaunchingapplicationsandfilesiniframe_iz_partname1804",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonelaunchingapplicationsandfilesiniframe_iz_partname1804_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "30",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonelogonoptions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonelogonoptions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonelogonoptions_iz_partname1a00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonelogonoptions_iz_partname1a00_65536",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "31",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonenavigatewindowsandframes",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonenavigatewindowsandframes_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonenavigatewindowsandframes_iz_partname1607",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonenavigatewindowsandframes_iz_partname1607_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "32",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallownetframeworkreliantcomponents",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallownetframeworkreliantcomponents_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallownetframeworkreliantcomponents_iz_partname2004",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallownetframeworkreliantcomponents_iz_partname2004_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "33",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonerunnetframeworkreliantcomponentssignedwithauthenticode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzonerunnetframeworkreliantcomponentssignedwithauthenticode_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzonerunnetframeworkreliantcomponentssignedwithauthenticode_iz_partname2001",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzonerunnetframeworkreliantcomponentssignedwithauthenticode_iz_partname2001_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "34",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneshowsecuritywarningforpotentiallyunsafefiles",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneshowsecuritywarningforpotentiallyunsafefiles_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneshowsecuritywarningforpotentiallyunsafefiles_iz_partname1806",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneshowsecuritywarningforpotentiallyunsafefiles_iz_partname1806_1",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "35",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenablecrosssitescriptingfilter",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenablecrosssitescriptingfilter_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenablecrosssitescriptingfilter_iz_partname1409",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenablecrosssitescriptingfilter_iz_partname1409_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "36",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenableprotectedmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenableprotectedmode_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneenableprotectedmode_iz_partname2500",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneenableprotectedmode_iz_partname2500_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "37",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneusepopupblocker",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneusepopupblocker_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneusepopupblocker_iz_partname1809",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneusepopupblocker_iz_partname1809_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "38",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowuserdatapersistence",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowuserdatapersistence_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowuserdatapersistence_iz_partname1606",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowuserdatapersistence_iz_partname1606_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "39",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowlessprivilegedsites",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowlessprivilegedsites_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowlessprivilegedsites_iz_partname2101",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_internetzoneallowlessprivilegedsites_iz_partname2101_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "40",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_includeallnetworkpaths",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_includeallnetworkpaths_0",
                         "children": []
                    }
               }
          },
          {
               "id": "41",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonedonotrunantimalwareagainstactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_intranetzonedonotrunantimalwareagainstactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonedonotrunantimalwareagainstactivexcontrols_iz_partname270c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_intranetzonedonotrunantimalwareagainstactivexcontrols_iz_partname270c_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "42",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzoneinitializeandscriptactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_intranetzoneinitializeandscriptactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzoneinitializeandscriptactivexcontrols_iz_partname1201",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_intranetzoneinitializeandscriptactivexcontrols_iz_partname1201_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "43",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_intranetzonejavapermissions_iz_partname1c00_65536",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "44",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_localmachinezonedonotrunantimalwareagainstactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_localmachinezonedonotrunantimalwareagainstactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_localmachinezonedonotrunantimalwareagainstactivexcontrols_iz_partname270c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_localmachinezonedonotrunantimalwareagainstactivexcontrols_iz_partname270c_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "45",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_localmachinezonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_localmachinezonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_localmachinezonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_localmachinezonejavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "46",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddownintranetjavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_lockeddownintranetjavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddownintranetjavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_lockeddownintranetjavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "47",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_lockeddownlocalmachinezonejavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "48",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddownrestrictedsiteszonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_lockeddownrestrictedsiteszonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddownrestrictedsiteszonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_lockeddownrestrictedsiteszonejavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "49",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddowntrustedsiteszonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_lockeddowntrustedsiteszonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_lockeddowntrustedsiteszonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_lockeddowntrustedsiteszonejavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "50",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowaccesstodatasources",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowaccesstodatasources_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowaccesstodatasources_iz_partname1406",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowaccesstodatasources_iz_partname1406_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "51",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowactivescripting",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowactivescripting_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowactivescripting_iz_partname1400",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowactivescripting_iz_partname1400_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "52",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowbinaryandscriptbehaviors",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowbinaryandscriptbehaviors_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowbinaryandscriptbehaviors_iz_partname2000",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowbinaryandscriptbehaviors_iz_partname2000_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "53",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowcopypasteviascript",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowcopypasteviascript_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowcopypasteviascript_iz_partname1407",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowcopypasteviascript_iz_partname1407_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "54",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowdraganddropcopyandpastefiles",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowdraganddropcopyandpastefiles_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowdraganddropcopyandpastefiles_iz_partname1802",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowdraganddropcopyandpastefiles_iz_partname1802_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "55",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowfiledownloads",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowfiledownloads_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowfiledownloads_iz_partname1803",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowfiledownloads_iz_partname1803_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "56",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowloadingofxamlfiles",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowloadingofxamlfiles_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowloadingofxamlfiles_iz_partname2402",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowloadingofxamlfiles_iz_partname2402_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "57",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowmetarefresh",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowmetarefresh_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowmetarefresh_iz_partname1608",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowmetarefresh_iz_partname1608_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "58",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstouseactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstouseactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstouseactivexcontrols_iz_partname120b",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstouseactivexcontrols_iz_partname120b_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "59",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstousetdcactivexcontrol",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstousetdcactivexcontrol_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstousetdcactivexcontrol_iz_partname120c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowonlyapproveddomainstousetdcactivexcontrol_iz_partname120c_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "60",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptinitiatedwindows",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptinitiatedwindows_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptinitiatedwindows_iz_partname2102",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptinitiatedwindows_iz_partname2102_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "61",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptingofinternetexplorerwebbrowsercontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptingofinternetexplorerwebbrowsercontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptingofinternetexplorerwebbrowsercontrols_iz_partname1206",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptingofinternetexplorerwebbrowsercontrols_iz_partname1206_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "62",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptlets",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptlets_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptlets_iz_partname1209",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowscriptlets_iz_partname1209_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "63",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowupdatestostatusbarviascript",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowupdatestostatusbarviascript_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowupdatestostatusbarviascript_iz_partname2103",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowupdatestostatusbarviascript_iz_partname2103_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "64",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowvbscripttorunininternetexplorer",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowvbscripttorunininternetexplorer_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowvbscripttorunininternetexplorer_iz_partname140c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowvbscripttorunininternetexplorer_iz_partname140c_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "65",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowautomaticpromptingforfiledownloads",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowautomaticpromptingforfiledownloads_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowautomaticpromptingforfiledownloads_iz_partname2200",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowautomaticpromptingforfiledownloads_iz_partname2200_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "66",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedonotrunantimalwareagainstactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedonotrunantimalwareagainstactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedonotrunantimalwareagainstactivexcontrols_iz_partname270c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedonotrunantimalwareagainstactivexcontrols_iz_partname270c_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "67",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadsignedactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadsignedactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadsignedactivexcontrols_iz_partname1001",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadsignedactivexcontrols_iz_partname1001_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "68",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadunsignedactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadunsignedactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadunsignedactivexcontrols_iz_partname1004",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonedownloadunsignedactivexcontrols_iz_partname1004_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "69",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainsacrosswindows",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainsacrosswindows_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainsacrosswindows_iz_partname2709",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainsacrosswindows_iz_partname2709_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "70",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainswithinwindows",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainswithinwindows_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainswithinwindows_iz_partname2708",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenabledraggingofcontentfromdifferentdomainswithinwindows_iz_partname2708_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "71",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneincludelocalpathwhenuploadingfilestoserver",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneincludelocalpathwhenuploadingfilestoserver_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneincludelocalpathwhenuploadingfilestoserver_iz_partname160a",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneincludelocalpathwhenuploadingfilestoserver_iz_partname160a_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "72",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneinitializeandscriptactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneinitializeandscriptactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneinitializeandscriptactivexcontrols_iz_partname1201",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneinitializeandscriptactivexcontrols_iz_partname1201_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "73",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonejavapermissions_iz_partname1c00_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "74",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelaunchingapplicationsandfilesiniframe",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelaunchingapplicationsandfilesiniframe_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelaunchingapplicationsandfilesiniframe_iz_partname1804",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelaunchingapplicationsandfilesiniframe_iz_partname1804_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "75",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelogonoptions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelogonoptions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelogonoptions_iz_partname1a00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonelogonoptions_iz_partname1a00_196608",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "76",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonenavigatewindowsandframes",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonenavigatewindowsandframes_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonenavigatewindowsandframes_iz_partname1607",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonenavigatewindowsandframes_iz_partname1607_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "77",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallownetframeworkreliantcomponents",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallownetframeworkreliantcomponents_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallownetframeworkreliantcomponents_iz_partname2004",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallownetframeworkreliantcomponents_iz_partname2004_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "78",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunnetframeworkreliantcomponentssignedwithauthenticode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunnetframeworkreliantcomponentssignedwithauthenticode_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunnetframeworkreliantcomponentssignedwithauthenticode_iz_partname2001",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunnetframeworkreliantcomponentssignedwithauthenticode_iz_partname2001_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "79",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunactivexcontrolsandplugins",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunactivexcontrolsandplugins_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunactivexcontrolsandplugins_iz_partname1200",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonerunactivexcontrolsandplugins_iz_partname1200_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "80",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptactivexcontrolsmarkedsafeforscripting",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptactivexcontrolsmarkedsafeforscripting_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptactivexcontrolsmarkedsafeforscripting_iz_partname1405",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptactivexcontrolsmarkedsafeforscripting_iz_partname1405_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "81",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptingofjavaapplets",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptingofjavaapplets_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptingofjavaapplets_iz_partname1402",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszonescriptingofjavaapplets_iz_partname1402_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "82",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneshowsecuritywarningforpotentiallyunsafefiles",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneshowsecuritywarningforpotentiallyunsafefiles_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneshowsecuritywarningforpotentiallyunsafefiles_iz_partname1806",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneshowsecuritywarningforpotentiallyunsafefiles_iz_partname1806_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "83",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenablecrosssitescriptingfilter",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenablecrosssitescriptingfilter_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenablecrosssitescriptingfilter_iz_partname1409",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneenablecrosssitescriptingfilter_iz_partname1409_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "84",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneturnonprotectedmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneturnonprotectedmode_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneturnonprotectedmode_iz_partname2500",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneturnonprotectedmode_iz_partname2500_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "85",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneusepopupblocker",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneusepopupblocker_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneusepopupblocker_iz_partname1809",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneusepopupblocker_iz_partname1809_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "86",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowuserdatapersistence",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowuserdatapersistence_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowuserdatapersistence_iz_partname1606",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowuserdatapersistence_iz_partname1606_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "87",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowlessprivilegedsites",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowlessprivilegedsites_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowlessprivilegedsites_iz_partname2101",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_restrictedsiteszoneallowlessprivilegedsites_iz_partname2101_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "88",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonedonotrunantimalwareagainstactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonedonotrunantimalwareagainstactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonedonotrunantimalwareagainstactivexcontrols_iz_partname270c",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonedonotrunantimalwareagainstactivexcontrols_iz_partname270c_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "89",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszoneinitializeandscriptactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszoneinitializeandscriptactivexcontrols_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszoneinitializeandscriptactivexcontrols_iz_partname1201",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszoneinitializeandscriptactivexcontrols_iz_partname1201_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "90",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonejavapermissions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonejavapermissions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonejavapermissions_iz_partname1c00",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_trustedsiteszonejavapermissions_iz_partname1c00_65536",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "91",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_allowcertificateaddressmismatchwarning",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_allowcertificateaddressmismatchwarning_1",
                         "children": []
                    }
               }
          },
          {
               "id": "92",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_preventperuserinstallationofactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_preventperuserinstallationofactivexcontrols_1",
                         "children": []
                    }
               }
          },
          {
               "id": "93",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_removerunthistimebuttonforoutdatedactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_removerunthistimebuttonforoutdatedactivexcontrols_1",
                         "children": []
                    }
               }
          },
          {
               "id": "94",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_donotblockoutdatedactivexcontrols_0",
                         "children": []
                    }
               }
          },
          {
               "id": "95",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_allowfallbacktossl3",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_allowfallbacktossl3_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_allowfallbacktossl3_advanced_enablessl3fallbackoptions",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_internetexplorer_allowfallbacktossl3_advanced_enablessl3fallbackoptions_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "96",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_consistentmimehandlinginternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_consistentmimehandlinginternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "97",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_mimesniffingsafetyfeatureinternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_mimesniffingsafetyfeatureinternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "98",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_mkprotocolsecurityrestrictioninternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_mkprotocolsecurityrestrictioninternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "99",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_notificationbarinternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_notificationbarinternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "100",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_protectionfromzoneelevationinternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_protectionfromzoneelevationinternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "101",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictactivexinstallinternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictactivexinstallinternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "102",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_restrictfiledownloadinternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "103",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_scriptedwindowsecurityrestrictionsinternetexplorerprocesses",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_scriptedwindowsecurityrestrictionsinternetexplorerprocesses_1",
                         "children": []
                    }
               }
          },
          {
               "id": "104",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_donotallowuserstoaddsites",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_donotallowuserstoaddsites_1",
                         "children": []
                    }
               }
          },
          {
               "id": "105",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_donotallowuserstochangepolicies",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_donotallowuserstochangepolicies_1",
                         "children": []
                    }
               }
          },
          {
               "id": "106",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_securityzonesuseonlymachinesettings",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_securityzonesuseonlymachinesettings_1",
                         "children": []
                    }
               }
          },
          {
               "id": "107",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_specifyuseofactivexinstallerservice",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_specifyuseofactivexinstallerservice_1",
                         "children": []
                    }
               }
          },
          {
               "id": "108",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disablecrashdetection",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_disablecrashdetection_1",
                         "children": []
                    }
               }
          },
          {
               "id": "109",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disablesecuritysettingscheck",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_internetexplorer_disablesecuritysettingscheck_0",
                         "children": []
                    }
               }
          },
          {
               "id": "110",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "user_vendor_msft_policy_config_internetexplorer_allowautocomplete",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "user_vendor_msft_policy_config_internetexplorer_allowautocomplete_0",
                         "children": []
                    }
               }
          }
     ]
}