{
     "creationSource": null,
     "description": "",
     "name": "POC_MAC_D_CO_SBL_MSZT_Firewall",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 1,
     "technologies": "mdm,appleRemoteManagement",
     "templateReference": {
          "templateId": "de730c94-09d5-4972-9672-1b9cefe77b64_1",
          "templateFamily": "endpointSecurityFirewall",
          "templateDisplayName": "macOS Firewall",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "1d79203d-05b3-41d2-b435-0403fc4141cb"
                    },
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.security.firewall_enablestealthmode",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.security.firewall_enablestealthmode_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.security.firewall_enablefirewall",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.security.firewall_enablefirewall_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.security.firewall_blockallincoming",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.security.firewall_blockallincoming_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "com.apple.security.firewall_allowsignedapp",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "com.apple.security.firewall_allowsignedapp_false",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                        "settingDefinitionId": "com.apple.security.firewall_applications",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "groupSettingCollectionValue": [
                                             {
                                                  "settingValueTemplateReference": null,
                                                  "children": [
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                            "settingDefinitionId": "com.apple.security.firewall_applications_item_bundleid",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "simpleSettingValue": {
                                                                 "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com."
                                                            }
                                                       },
                                                       {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                            "settingDefinitionId": "com.apple.security.firewall_applications_item_allowed",
                                                            "settingInstanceTemplateReference": null,
                                                            "auditRuleInformation": null,
                                                            "choiceSettingValue": {
                                                                 "settingValueTemplateReference": null,
                                                                 "value": "com.apple.security.firewall_applications_item_allowed_false",
                                                                 "children": []
                                                            }
                                                       }
                                                  ]
                                             }
                                        ]
                                   }
                              ]
                         }
                    ]
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}