{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_MSZT_WindowsHello",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 2,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "fcef01f2-439d-4c3f-9184-823fd6e97646_1",
          "templateFamily": "endpointSecurityAccountProtection",
          "templateDisplayName": "Account Protection",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "9a29ce6b-fae8-4785-bbfe-3311f14aa88f"
                    },
                    "choiceSettingValue": {
                         "value": "device_vendor_msft_passportforwork_biometrics_facialfeaturesuseenhancedantispoofing_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "93a7ef59-584d-4177-ac5a-2ca31d47e179",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "0ece2bdc-57c1-4be9-93e9-ac9c395a9c94"
                    },
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery",
                                        "auditRuleInformation": null,
                                        "settingInstanceTemplateReference": {
                                             "settingInstanceTemplateId": "f7ac8ff7-1b26-469b-9872-00d68961fdc5"
                                        },
                                        "choiceSettingValue": {
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_enablepinrecovery_true",
                                             "settingValueTemplateReference": {
                                                  "settingValueTemplateId": "06ebb101-6342-4081-b208-87a13151afa5",
                                                  "useTemplateDefault": false
                                             },
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_history",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "value": 24,
                                             "settingValueTemplateReference": {
                                                  "settingValueTemplateId": "55c0e424-1a3a-4990-a78b-de0eb8a92e0f",
                                                  "useTemplateDefault": false
                                             }
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_lowercaseletters_0",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_maximumpinlength",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "value": 127,
                                             "settingValueTemplateReference": {
                                                  "settingValueTemplateId": "39465b14-29ec-4996-98d2-736b7a168e62",
                                                  "useTemplateDefault": false
                                             }
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_minimumpinlength",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "value": 6,
                                             "settingValueTemplateReference": {
                                                  "settingValueTemplateId": "b2cec844-c747-466e-ae20-92969da2a10c",
                                                  "useTemplateDefault": false
                                             }
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_specialcharacters_0",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_pincomplexity_uppercaseletters_0",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_requiresecuritydevice_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_usecertificateforonpremauth_false",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_passportforwork_{tenantid}_policies_usepassportforwork_true",
                                             "children": []
                                        }
                                   }
                              ]
                         }
                    ]
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}