{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_CIS_MS_DeviceLock",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 2,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                                        "children": [
                                             {
                                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                  "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters",
                                                  "settingInstanceTemplateReference": null,
                                                  "auditRuleInformation": null,
                                                  "choiceSettingValue": {
                                                       "settingValueTemplateReference": null,
                                                       "value": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_2",
                                                       "children": []
                                                  }
                                             }
                                        ]
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordexpiration",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": 365
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_maxdevicepasswordfailedattempts",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": 5
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelock",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": 15
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordlength",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": 14
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_minimumpasswordage",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "settingValueTemplateReference": null,
                         "value": 1
                    }
               }
          }
     ]
}