{
     "creationSource": null,
     "description": "CIS (L1) Section 15 - 104 - Windows 11 Intune 4.0.0\n\nRemoved\nConfigure System Guard Launch: Unmanaged Enables Secure Launch if supported by hardware\nEnable Virtualization Based Security: enable virtualization based security.\nDO Download Mode: HTTP only",
     "name": "POC_WIN_D_CO_SBL_CIS_MS_DeviceConfiguration",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 42,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_grouppolicy_cse_registry",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nobackground10",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nobackground10_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nochanges10",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_admx_grouppolicy_cse_registry_cse_nochanges10_1",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "device_vendor_msft_dmclient_provider_{providerid}",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_enabled_true",
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_dmclient_provider_{providerid}_configrefresh_cadence",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "simpleSettingValue": {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": 90
                                        }
                                   }
                              ]
                         }
                    ]
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1",
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_deviceguard_requireplatformsecurityfeatures_1",
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_experience_allowcortana",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_experience_allowcortana_0",
                         "children": []
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "user_vendor_msft_policy_config_experience_allowspotlightcollection",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "settingValueTemplateReference": null,
                         "value": 0
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "user_vendor_msft_policy_config_experience_allowwindowsspotlight",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "user_vendor_msft_policy_config_experience_allowwindowsspotlight_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "user_vendor_msft_policy_config_experience_allowthirdpartysuggestionsinwindowsspotlight",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "user_vendor_msft_policy_config_experience_allowthirdpartysuggestionsinwindowsspotlight_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_experience_allowwindowsconsumerfeatures",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_experience_allowwindowsconsumerfeatures_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_experience_disableconsumeraccountstatecontent",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_experience_disableconsumeraccountstatecontent_1",
                         "children": []
                    }
               }
          },
          {
               "id": "8",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_experience_donotshowfeedbacknotifications",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_experience_donotshowfeedbacknotifications_1",
                         "children": []
                    }
               }
          },
          {
               "id": "9",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_enableinsecureguestlogons",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_enableinsecureguestlogons_0",
                         "children": []
                    }
               }
          },
          {
               "id": "10",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_localsecurityauthority_configurelsaprotectedprocess",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_localsecurityauthority_configurelsaprotectedprocess_1",
                         "children": []
                    }
               }
          },
          {
               "id": "11",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowappstoreautoupdate",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_applicationmanagement_allowappstoreautoupdate_1",
                         "children": []
                    }
               }
          },
          {
               "id": "12",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_allowgamedvr",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_applicationmanagement_allowgamedvr_0",
                         "children": []
                    }
               }
          },
          {
               "id": "13",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_blocknonadminuserinstall",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_applicationmanagement_blocknonadminuserinstall_1",
                         "children": []
                    }
               }
          },
          {
               "id": "14",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_msiallowusercontroloverinstall",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_applicationmanagement_msiallowusercontroloverinstall_0",
                         "children": []
                    }
               }
          },
          {
               "id": "15",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges_0",
                         "children": []
                    }
               }
          },
          {
               "id": "16",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "user_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "user_vendor_msft_policy_config_applicationmanagement_msialwaysinstallwithelevatedprivileges_0",
                         "children": []
                    }
               }
          },
          {
               "id": "17",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_privacy_allowinputpersonalization",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_privacy_allowinputpersonalization_0",
                         "children": []
                    }
               }
          },
          {
               "id": "18",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_privacy_letappsactivatewithvoiceabovelock",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_privacy_letappsactivatewithvoiceabovelock_2",
                         "children": []
                    }
               }
          },
          {
               "id": "19",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_search_allowindexingencryptedstoresoritems",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_search_allowindexingencryptedstoresoritems_0",
                         "children": []
                    }
               }
          },
          {
               "id": "20",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_search_allowsearchtouselocation",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_search_allowsearchtouselocation_0",
                         "children": []
                    }
               }
          },
          {
               "id": "21",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_webthreatdefense_notifymalicious",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_webthreatdefense_notifymalicious_1",
                         "children": []
                    }
               }
          },
          {
               "id": "22",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_webthreatdefense_notifypasswordreuse",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_webthreatdefense_notifypasswordreuse_1",
                         "children": []
                    }
               }
          },
          {
               "id": "23",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_webthreatdefense_notifyunsafeapp",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_webthreatdefense_notifyunsafeapp_1",
                         "children": []
                    }
               }
          },
          {
               "id": "24",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_webthreatdefense_serviceenabled",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_webthreatdefense_serviceenabled_1",
                         "children": []
                    }
               }
          },
          {
               "id": "25",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_sudo_enablesudo",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_sudo_enablesudo_0",
                         "children": []
                    }
               }
          },
          {
               "id": "26",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_system_allowtelemetry",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_system_allowtelemetry_1",
                         "children": []
                    }
               }
          },
          {
               "id": "27",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_system_enableonesettingsauditing",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_system_enableonesettingsauditing_1",
                         "children": []
                    }
               }
          },
          {
               "id": "28",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_system_limitdiagnosticlogcollection",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_system_limitdiagnosticlogcollection_1",
                         "children": []
                    }
               }
          },
          {
               "id": "29",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_system_limitdumpcollection",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_system_limitdumpcollection_1",
                         "children": []
                    }
               }
          },
          {
               "id": "30",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode_4",
                         "children": []
                    }
               }
          },
          {
               "id": "31",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode_4",
                         "children": []
                    }
               }
          },
          {
               "id": "32",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode_4",
                         "children": []
                    }
               }
          },
          {
               "id": "33",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode_4",
                         "children": []
                    }
               }
          },
          {
               "id": "34",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_taskscheduler_enablexboxgamesavetask",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_taskscheduler_enablexboxgamesavetask_0",
                         "children": []
                    }
               }
          },
          {
               "id": "35",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_virtualizationbasedtechnology_requireuefimemoryattributestable_1",
                         "children": []
                    }
               }
          },
          {
               "id": "36",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_wifi_allowautoconnecttowifisensehotspots",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_wifi_allowautoconnecttowifisensehotspots_0",
                         "children": []
                    }
               }
          },
          {
               "id": "37",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_newsandinterests_allownewsandinterests",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_newsandinterests_allownewsandinterests_0",
                         "children": []
                    }
               }
          },
          {
               "id": "38",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace_1",
                         "children": []
                    }
               }
          },
          {
               "id": "39",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_windowssandbox_allowclipboardredirection",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_windowssandbox_allowclipboardredirection_0",
                         "children": []
                    }
               }
          },
          {
               "id": "40",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_windowssandbox_allownetworking",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_windowssandbox_allownetworking_0",
                         "children": []
                    }
               }
          },
          {
               "id": "41",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_wirelessdisplay_requirepinforpairing",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_wirelessdisplay_requirepinforpairing_1",
                         "children": []
                    }
               }
          }
     ]
}