{
     "creationSource": null,
     "description": "",
     "name": "POC_MAC_D_CO_SBL_MSZT_Defender_Antivirus",
     "platforms": "macOS",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 9,
     "technologies": "mdm,microsoftSense",
     "templateReference": {
          "templateId": "2d345ec2-c817-49e5-9156-3ed416dc972a_1",
          "templateFamily": "endpointSecurityAntivirus",
          "templateDisplayName": "Microsoft Defender Antivirus",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_enabled",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "9e424cc6-35b9-48ef-863c-73295aa9d2d7"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_enabled_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "7ea0a2aa-0953-4340-b590-522f040b0da3",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_automaticsamplesubmission",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "d5563bad-08c5-47de-8bbb-5d44e0f9a23a"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_automaticsamplesubmission_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "de57abd5-1a87-463e-96e7-e117524003ba",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_diagnosticlevel",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "c7a9a79b-20cf-461f-8021-94702a32543b"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_diagnosticlevel_0",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "5fc10db6-9ee5-434a-9ed0-1382bf72969e",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "cc18c6dc-dca5-4845-9c78-c718c9447ddd"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "112fd4a8-1393-49b6-9569-0d37266a6ad3",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "65d9ddaf-0552-4e40-8575-71dd54b2ccb4"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_0",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "613bcf39-69ec-4a1f-8822-07789ae7f8cb",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_exclusionsmergepolicy",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "c07a6983-ac3e-4f38-be45-20954638dabd"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_exclusionsmergepolicy_0",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "effc409a-9169-43f0-a807-2a388875cf99",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "a1bf7f4c-196e-4930-8395-a9b496433322"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "440003a2-8406-47bb-a785-a45869556ead",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "94f6f35c-4cee-4a61-930a-491b698c790a"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_enforcementlevel_1",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "96ced765-4f68-441a-b9ad-b683cfdfa28f",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "8",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "3c4efab3-cf91-4540-b86d-54507c90bb4b"
                    },
                    "choiceSettingValue": {
                         "value": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection_2",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "6e25fd09-16f1-42fd-9ffe-954ee1c0b904",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}