{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_NCSC_MS_GoogleChrome",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 4,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_urlblocklist",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_urlblocklist_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome_urlblocklist_urlblocklistdesc",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingCollectionValue": [
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "chrome://flags"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "chrome://net-internals"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "chrome://tracing"
                                        }
                                   ]
                              }
                         ]
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallallowlist",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallallowlist_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallallowlist_extensioninstallallowlistdesc",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingCollectionValue": [
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "gojbdfnpnhogfdgjbigejoaolejmgdhk"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "jpalhdlnbpafiamejdnhcphjbkeiagm"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "ajdhfcoppbpocmaeoechanfllkoemlhi"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "niloccemoadcdkdjlinkgdfekeahmflj"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "cfhdojbkjhnklbpkdaibdccddilifddb"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "ogfcmafjalglgifnmanfmnieipoejdcf"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "bkbeeeffjjeopflfhgeknacdieedcoml"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "ppnbnpeolgkicgegkbkbjmhlideopiji"
                                        }
                                   ]
                              }
                         ]
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallblocklist",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallblocklist_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingCollectionValue": [
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "*"
                                        }
                                   ]
                              }
                         ]
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallforcelist",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallforcelist_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_chromeintunev1~policy~googlechrome~extensions_extensioninstallforcelist_extensioninstallforcelistdesc",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingCollectionValue": [
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "bkbeeeffjjeopflfhgeknacdieedcoml"
                                        },
                                        {
                                             "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                             "settingValueTemplateReference": null,
                                             "value": "ppnbnpeolgkicgegkbkbjmhlideopiji"
                                        }
                                   ]
                              }
                         ]
                    }
               }
          }
     ]
}