{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_MSZT_Firewall",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 8,
     "technologies": "mdm,microsoftSense",
     "templateReference": {
          "templateId": "6078910e-d808-4a9f-a51d-1b8a7bacb7c0_1",
          "templateFamily": "endpointSecurityFirewall",
          "templateDisplayName": "Windows Firewall",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_crlcheck",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "e7a56c46-ef6b-453b-a280-5c5677eed4b2"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_global_crlcheck_0",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "95ffe5ce-c873-420f-aeba-b740b513251b",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_disablestatefulftp",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "38329af6-2670-4a71-972d-482010ca97fc"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_global_disablestatefulftp_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "559f6e01-53a9-4c10-9f10-d09d8fe7f903",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "a49fb169-715e-42ea-9916-35ac9de66f69"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding_1",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "25ecf79d-adde-4cbd-948b-c1095058a6ee",
                              "useTemplateDefault": false
                         },
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_saidletime",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "2663b68f-6624-4cf2-ba68-9d355b086824"
                    },
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "value": 300,
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "39a12cfe-2766-40a1-b63f-292ead946168",
                              "useTemplateDefault": false
                         }
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "7714c373-a19a-4b64-ba6d-2e9db04a7684"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                              "useTemplateDefault": false
                         },
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_1",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_shielded",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_shielded_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_logmaxfilesize",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "value": 16384,
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                                             "useTemplateDefault": false
                                        }
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_logfilepath",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall-dom.log",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                                             "useTemplateDefault": false
                                        }
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_enablepacketqueue",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "290a576c-b314-4305-98e7-ac98ad5452c4"
                    },
                    "choiceSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_global_enablepacketqueue_0",
                              "children": []
                         }
                    ]
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "1c14f914-69bb-49f8-af5b-e29173a6ee95"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                              "useTemplateDefault": false
                         },
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_shielded",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_shielded_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "value": 16384,
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                                             "useTemplateDefault": false
                                        }
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_logfilepath",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall-pri.log",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                                             "useTemplateDefault": false
                                        }
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "e2714734-708e-4286-8ae9-d56821e306a3"
                    },
                    "choiceSettingValue": {
                         "value": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true",
                         "settingValueTemplateReference": {
                              "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                              "useTemplateDefault": false
                         },
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_shielded",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_shielded_false",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_false",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_false",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections_true",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        },
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_logmaxfilesize",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "value": 16384,
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        }
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_logfilepath",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall-pub.log",
                                        "settingValueTemplateReference": {
                                             "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                                             "useTemplateDefault": false
                                        }
                                   }
                              }
                         ]
                    }
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}