{
     "creationSource": null,
     "description": "CIS (L1) Section 1 - 4.9.1.1 - Windows 11 Intune 4.0.0",
     "name": "POC_WIN_D_CO_SBL_CIS_MS_NetworkSecurity",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 47,
     "technologies": "mdm",
     "templateReference": {
          "templateId": "",
          "templateFamily": "none",
          "templateDisplayName": null,
          "templateDisplayVersion": null
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_abovelock_allowcortanaabovelock",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_abovelock_allowcortanaabovelock_0",
                         "children": []
                    }
               }
          },
          {
               "id": "1",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_devicelock_preventenablinglockscreencamera_1",
                         "children": []
                    }
               }
          },
          {
               "id": "2",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_devicelock_preventlockscreenslideshow_1",
                         "children": []
                    }
               }
          },
          {
               "id": "3",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_mssecurityguide_applyuacrestrictionstolocalaccountsonnetworklogon_1",
                         "children": []
                    }
               }
          },
          {
               "id": "4",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1clientdriver_pol_secguide_smb1clientdriver_4",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "5",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_mssecurityguide_configuresmbv1server_0",
                         "children": []
                    }
               }
          },
          {
               "id": "6",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_mssecurityguide_enablestructuredexceptionhandlingoverwriteprotection_1",
                         "children": []
                    }
               }
          },
          {
               "id": "7",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_mssecurityguide_wdigestauthentication_0",
                         "children": []
                    }
               }
          },
          {
               "id": "8",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_msslegacy_ipv6sourceroutingprotectionlevel_disableipsourceroutingipv6_2",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "9",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_msslegacy_ipsourceroutingprotectionlevel_disableipsourcerouting_2",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "10",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_msslegacy_allowicmpredirectstooverrideospfgeneratedroutes_0",
                         "children": []
                    }
               }
          },
          {
               "id": "11",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_msslegacy_allowthecomputertoignorenetbiosnamereleaserequestsexceptfromwinsservers_1",
                         "children": []
                    }
               }
          },
          {
               "id": "12",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_safedllsearchmode",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_safedllsearchmode_1",
                         "children": []
                    }
               }
          },
          {
               "id": "13",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_screensavergraceperiod",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_screensavergraceperiod_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_screensavergraceperiod_screensavergraceperiod",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": 5
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "14",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_warninglevel",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_warninglevel_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_warninglevel_warninglevel",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_admx_mss-legacy_pol_mss_warninglevel_warninglevel_90",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "15",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast_1",
                         "children": []
                    }
               }
          },
          {
               "id": "16",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge_1",
                         "children": []
                    }
               }
          },
          {
               "id": "17",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui_1",
                         "children": []
                    }
               }
          },
          {
               "id": "18",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation_1",
                         "children": []
                    }
               }
          },
          {
               "id": "19",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "groupSettingCollectionValue": [
                                        {
                                             "settingValueTemplateReference": null,
                                             "children": [
                                                  {
                                                       "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                       "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                                                       "settingInstanceTemplateReference": null,
                                                       "auditRuleInformation": null,
                                                       "simpleSettingValue": {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                            "settingValueTemplateReference": null,
                                                            "value": "\\\\*\\NETLOGON"
                                                       }
                                                  },
                                                  {
                                                       "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                       "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                                                       "settingInstanceTemplateReference": null,
                                                       "auditRuleInformation": null,
                                                       "simpleSettingValue": {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                            "settingValueTemplateReference": null,
                                                            "value": "RequireIntegrity=1,RequireMutualAuthentication=1,RequirePrivacy=1"
                                                       }
                                                  }
                                             ]
                                        },
                                        {
                                             "settingValueTemplateReference": null,
                                             "children": [
                                                  {
                                                       "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                       "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                                                       "settingInstanceTemplateReference": null,
                                                       "auditRuleInformation": null,
                                                       "simpleSettingValue": {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                            "settingValueTemplateReference": null,
                                                            "value": "\\\\*\\SYSVOL"
                                                       }
                                                  },
                                                  {
                                                       "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                       "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                                                       "settingInstanceTemplateReference": null,
                                                       "auditRuleInformation": null,
                                                       "simpleSettingValue": {
                                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                            "settingValueTemplateReference": null,
                                                            "value": "RequireIntegrity=1,RequireMutualAuthentication=1,RequirePrivacy=1"
                                                       }
                                                  }
                                             ]
                                        }
                                   ]
                              }
                         ]
                    }
               }
          },
          {
               "id": "20",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_3",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "21",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1",
                         "children": []
                    }
               }
          },
          {
               "id": "22",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_admx_printing2_registerspoolerremoterpcendpoint",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_admx_printing2_registerspoolerremoterpcendpoint_0",
                         "children": []
                    }
               }
          },
          {
               "id": "23",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_configureredirectionguardpolicy_redirectionguardpolicy_enum_1",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "24",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionprotocol_enum_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_configurerpcconnectionpolicy_rpcconnectionauthentication_enum_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "25",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpcauthenticationprotocol_enum_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_configurerpclistenerpolicy_rpclistenerprotocols_enum_5",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "26",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpctcpport",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_configurerpctcpport_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurerpctcpport_rpctcpport",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": 0
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "27",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_restrictdriverinstallationtoadministrators_1",
                         "children": []
                    }
               }
          },
          {
               "id": "28",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_configurecopyfilespolicy_copyfilespolicy_enum_1",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "29",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_printers_pointandprintrestrictions",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_1",
                         "children": [
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedservers_edit",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": ""
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedforest_chk",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedforest_chk_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedservers_chk",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_trustedservers_chk_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationoninstall_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationoninstall_enum_0",
                                        "children": []
                                   }
                              },
                              {
                                   "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                   "settingDefinitionId": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationonupdate_enum",
                                   "settingInstanceTemplateReference": null,
                                   "auditRuleInformation": null,
                                   "choiceSettingValue": {
                                        "settingValueTemplateReference": null,
                                        "value": "device_vendor_msft_policy_config_printers_pointandprintrestrictions_pointandprint_nowarningnoelevationonupdate_enum_0",
                                        "children": []
                                   }
                              }
                         ]
                    }
               }
          },
          {
               "id": "30",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1",
                         "children": []
                    }
               }
          },
          {
               "id": "31",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportencryption",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportencryption_1",
                         "children": []
                    }
               }
          },
          {
               "id": "32",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportsigning",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_auditclientdoesnotsupportsigning_1",
                         "children": []
                    }
               }
          },
          {
               "id": "33",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_auditinsecureguestlogon",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_auditinsecureguestlogon_1",
                         "children": []
                    }
               }
          },
          {
               "id": "34",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_authratelimiterdelayinms",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "simpleSettingValue": {
                         "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                         "settingValueTemplateReference": null,
                         "value": 2000
                    }
               }
          },
          {
               "id": "35",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_enableauthratelimiter",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_enableauthratelimiter_1",
                         "children": []
                    }
               }
          },
          {
               "id": "36",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_enablemailslots",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_enablemailslots_0",
                         "children": []
                    }
               }
          },
          {
               "id": "37",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_maxsmb2dialect",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_maxsmb2dialect_785",
                         "children": []
                    }
               }
          },
          {
               "id": "38",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanserver_minsmb2dialect",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanserver_minsmb2dialect_768",
                         "children": []
                    }
               }
          },
          {
               "id": "39",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_auditinsecureguestlogon",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_auditinsecureguestlogon_1",
                         "children": []
                    }
               }
          },
          {
               "id": "40",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportencryption",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportencryption_1",
                         "children": []
                    }
               }
          },
          {
               "id": "41",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportsigning",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_auditserverdoesnotsupportsigning_1",
                         "children": []
                    }
               }
          },
          {
               "id": "42",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_enablemailslots",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_enablemailslots_0",
                         "children": []
                    }
               }
          },
          {
               "id": "43",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_maxsmb2dialect",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_maxsmb2dialect_785",
                         "children": []
                    }
               }
          },
          {
               "id": "44",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_minsmb2dialect",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_minsmb2dialect_768",
                         "children": []
                    }
               }
          },
          {
               "id": "45",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_requireencryption",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_lanmanworkstation_requireencryption_0",
                         "children": []
                    }
               }
          },
          {
               "id": "46",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_wifi_allowinternetsharing",
                    "settingInstanceTemplateReference": null,
                    "auditRuleInformation": null,
                    "choiceSettingValue": {
                         "settingValueTemplateReference": null,
                         "value": "device_vendor_msft_policy_config_wifi_allowinternetsharing_0",
                         "children": []
                    }
               }
          }
     ]
}