{
     "creationSource": null,
     "description": "",
     "name": "POC_WIN_D_CO_SBL_MSZT_Defender_AttackSurfaceReduction",
     "platforms": "windows10",
     "priorityMetaData": null,
     "roleScopeTagIds": [
          "Default"
     ],
     "settingCount": 1,
     "technologies": "mdm,microsoftSense",
     "templateReference": {
          "templateId": "e8c053d6-9f95-42b1-a7f1-ebfd71c67a4b_1",
          "templateFamily": "endpointSecurityAttackSurfaceReduction",
          "templateDisplayName": "Attack Surface Reduction Rules",
          "templateDisplayVersion": "Version 1"
     },
     "settings": [
          {
               "id": "0",
               "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
                    "auditRuleInformation": null,
                    "settingInstanceTemplateReference": {
                         "settingInstanceTemplateId": "19600663-e264-4c02-8f55-f2983216d6d7"
                    },
                    "groupSettingCollectionValue": [
                         {
                              "settingValueTemplateReference": null,
                              "children": [
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts",
                                        "auditRuleInformation": null,
                                        "settingInstanceTemplateReference": {
                                             "settingInstanceTemplateId": "e416083e-05e3-4237-b8ec-a6ad49c4571e"
                                        },
                                        "choiceSettingValue": {
                                             "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts_block",
                                             "settingValueTemplateReference": {
                                                  "settingValueTemplateId": "8b17ebce-496f-4b58-9d89-dd1c3861de39",
                                                  "useTemplateDefault": false
                                             },
                                             "children": []
                                        }
                                   },
                                   {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros",
                                        "settingInstanceTemplateReference": null,
                                        "auditRuleInformation": null,
                                        "choiceSettingValue": {
                                             "settingValueTemplateReference": null,
                                             "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros_block",
                                             "children": []
                                        }
                                   }
                              ]
                         }
                    ]
               }
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}