{
     "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
     "roleScopeTagIds": [
          "Default"
     ],
     "deviceManagementApplicabilityRuleOsEdition": null,
     "deviceManagementApplicabilityRuleOsVersion": null,
     "deviceManagementApplicabilityRuleDeviceMode": null,
     "description": "",
     "displayName": "POC_WIN_D_CO_SBL_MSZT_Updates",
     "deliveryOptimizationMode": "userDefined",
     "prereleaseFeatures": "userDefined",
     "automaticUpdateMode": "autoInstallAtMaintenanceTime",
     "microsoftUpdateServiceAllowed": true,
     "driversExcluded": false,
     "qualityUpdatesDeferralPeriodInDays": 0,
     "featureUpdatesDeferralPeriodInDays": 0,
     "qualityUpdatesPaused": false,
     "featureUpdatesPaused": false,
     "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
     "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
     "businessReadyUpdatesOnly": "userDefined",
     "skipChecksBeforeRestart": false,
     "updateWeeks": null,
     "qualityUpdatesPauseStartDate": null,
     "featureUpdatesPauseStartDate": null,
     "featureUpdatesRollbackWindowInDays": 30,
     "qualityUpdatesWillBeRolledBack": false,
     "featureUpdatesWillBeRolledBack": false,
     "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
     "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
     "engagedRestartDeadlineInDays": null,
     "engagedRestartSnoozeScheduleInDays": null,
     "engagedRestartTransitionScheduleInDays": null,
     "deadlineForFeatureUpdatesInDays": null,
     "deadlineForQualityUpdatesInDays": 10,
     "deadlineGracePeriodInDays": 4,
     "postponeRebootUntilAfterDeadline": true,
     "autoRestartNotificationDismissal": "notConfigured",
     "scheduleRestartWarningInHours": null,
     "scheduleImminentRestartWarningInMinutes": null,
     "userPauseAccess": "enabled",
     "userWindowsUpdateScanAccess": "enabled",
     "updateNotificationLevel": "defaultNotifications",
     "allowWindows11Upgrade": false,
     "installationSchedule": {
          "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
          "activeHoursStart": "08:00:00.0000000",
          "activeHoursEnd": "17:00:00.0000000"
     },
     "assignments": [
          {
               "source": "direct",
               "intent": "apply",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}