{
     "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
     "roleScopeTagIds": [
          "Default"
     ],
     "deviceManagementApplicabilityRuleOsEdition": null,
     "deviceManagementApplicabilityRuleOsVersion": null,
     "deviceManagementApplicabilityRuleDeviceMode": null,
     "description": null,
     "displayName": "POC_WIN_D_CO_SBL_MSZT_EndpointAnalytics",
     "allowDeviceHealthMonitoring": "enabled",
     "configDeviceHealthMonitoringScope": "bootPerformance",
     "configDeviceHealthMonitoringCustomScope": null,
     "assignments": [
          {
               "source": "direct",
               "intent": "apply",
               "target": {
                    "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}