{
     "@odata.type": "#microsoft.graph.deviceEnrollmentWindowsHelloForBusinessConfiguration",
     "displayName": "All users and all devices",
     "description": "This is the default Windows Hello for Business configuration applied with the lowest priority to all users regardless of group membership.",
     "priority": 0,
     "roleScopeTagIds": [],
     "deviceEnrollmentConfigurationType": "windowsHelloForBusiness",
     "pinMinimumLength": 6,
     "pinMaximumLength": 127,
     "pinUppercaseCharactersUsage": "allowed",
     "pinLowercaseCharactersUsage": "allowed",
     "pinSpecialCharactersUsage": "allowed",
     "state": "enabled",
     "securityDeviceRequired": true,
     "unlockWithBiometricsEnabled": true,
     "remotePassportEnabled": false,
     "pinPreviousBlockCount": 24,
     "pinExpirationInDays": 0,
     "enhancedBiometricsState": "enabled",
     "securityKeyForSignIn": "disabled",
     "enhancedSignInSecurity": 1
}