{
     "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionConfiguration",
     "displayName": "POC_WIN_U_BYOD_Allow_AllUsers",
     "description": "",
     "priority": 1,
     "roleScopeTagIds": [
          "Default"
     ],
     "deviceEnrollmentConfigurationType": "singlePlatformRestriction",
     "platformType": "windows",
     "platformRestriction": {
          "platformBlocked": false,
          "personalDeviceEnrollmentBlocked": false,
          "osMinimumVersion": "10.0.19045.0000",
          "osMaximumVersion": "10.0.26100.9999",
          "blockedManufacturers": [],
          "blockedSkus": []
     }
}