{
     "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionConfiguration",
     "displayName": "POC_WIN_U_CO_Allow_AllUsers",
     "description": "",
     "priority": 2,
     "roleScopeTagIds": [
          "Default"
     ],
     "deviceEnrollmentConfigurationType": "singlePlatformRestriction",
     "platformType": "windows",
     "platformRestriction": {
          "platformBlocked": false,
          "personalDeviceEnrollmentBlocked": true,
          "osMinimumVersion": null,
          "osMaximumVersion": null,
          "blockedManufacturers": [],
          "blockedSkus": []
     }
}