{
     "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionConfiguration",
     "displayName": "POC_WIN_U_BYOD_Allow_AllUsers_NotHome",
     "description": "",
     "priority": 3,
     "roleScopeTagIds": [
          "Default"
     ],
     "deviceEnrollmentConfigurationType": "singlePlatformRestriction",
     "platformType": "windows",
     "platformRestriction": {
          "platformBlocked": false,
          "personalDeviceEnrollmentBlocked": false,
          "osMinimumVersion": null,
          "osMaximumVersion": null,
          "blockedManufacturers": [],
          "blockedSkus": []
     }
}