{
     "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
     "roleScopeTagIds": [
          "Default"
     ],
     "description": null,
     "displayName": "POC_AND_D_CO_SBL_MSZT_DeviceCompliance",
     "deviceThreatProtectionEnabled": false,
     "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
     "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
     "securityBlockJailbrokenDevices": true,
     "securityRequireSafetyNetAttestationBasicIntegrity": null,
     "securityRequireSafetyNetAttestationCertifiedDevice": null,
     "osMinimumVersion": "13.0",
     "osMaximumVersion": null,
     "minAndroidSecurityPatchLevel": null,
     "passwordRequired": true,
     "passwordMinimumLength": 6,
     "passwordMinimumLetterCharacters": null,
     "passwordMinimumLowerCaseCharacters": null,
     "passwordMinimumNonLetterCharacters": null,
     "passwordMinimumNumericCharacters": null,
     "passwordMinimumSymbolCharacters": null,
     "passwordMinimumUpperCaseCharacters": null,
     "passwordRequiredType": "numericComplex",
     "passwordMinutesOfInactivityBeforeLock": 5,
     "passwordExpirationDays": null,
     "passwordPreviousPasswordCountToBlock": 24,
     "storageRequireEncryption": true,
     "securityRequireIntuneAppIntegrity": true,
     "requireNoPendingSystemUpdates": null,
     "securityRequiredAndroidSafetyNetEvaluationType": null,
     "scheduledActionsForRule": [
          {
               "ruleName": null,
               "scheduledActionConfigurations": [
                    {
                         "gracePeriodHours": 0,
                         "actionType": "block",
                         "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                         "notificationMessageCCList": []
                    }
               ]
          }
     ]
}