{
     "@odata.type": "#microsoft.graph.iosCompliancePolicy",
     "roleScopeTagIds": [
          "Default"
     ],
     "description": null,
     "displayName": "POC_IOS_U_BYOD_SBL_MSZT_DeviceCompliance",
     "passcodeBlockSimple": true,
     "passcodeExpirationDays": null,
     "passcodeMinimumLength": 6,
     "passcodeMinutesOfInactivityBeforeLock": 0,
     "passcodeMinutesOfInactivityBeforeScreenTimeout": 5,
     "passcodePreviousPasscodeBlockCount": 24,
     "passcodeMinimumCharacterSetCount": null,
     "passcodeRequiredType": "numeric",
     "passcodeRequired": true,
     "osMinimumVersion": "18.0",
     "osMaximumVersion": null,
     "osMinimumBuildVersion": null,
     "osMaximumBuildVersion": null,
     "securityBlockJailbrokenDevices": true,
     "deviceThreatProtectionEnabled": false,
     "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
     "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
     "managedEmailProfileRequired": false,
     "restrictedApps": [],
     "scheduledActionsForRule": [
          {
               "ruleName": null,
               "scheduledActionConfigurations": [
                    {
                         "gracePeriodHours": 0,
                         "actionType": "block",
                         "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                         "notificationMessageCCList": []
                    }
               ]
          }
     ]
}