{
     "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
     "roleScopeTagIds": [
          "Default"
     ],
     "description": null,
     "displayName": "POC_AND_D_BYOD_SBL_MSZT_DeviceCompliance",
     "passwordRequired": true,
     "passwordMinimumLength": 6,
     "passwordRequiredType": "numericComplex",
     "requiredPasswordComplexity": "medium",
     "passwordMinutesOfInactivityBeforeLock": 5,
     "passwordExpirationDays": null,
     "passwordPreviousPasswordBlockCount": 24,
     "passwordSignInFailureCountBeforeFactoryReset": null,
     "workProfilePasswordExpirationInDays": null,
     "workProfilePasswordMinimumLength": 6,
     "workProfileInactiveBeforeScreenLockInMinutes": 5,
     "workProfilePreviousPasswordBlockCount": 24,
     "workProfilePasswordRequiredType": "numericComplex",
     "workProfileRequiredPasswordComplexity": "medium",
     "workProfileRequirePassword": true,
     "securityPreventInstallAppsFromUnknownSources": true,
     "securityDisableUsbDebugging": true,
     "securityRequireVerifyApps": false,
     "deviceThreatProtectionEnabled": false,
     "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
     "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
     "securityBlockJailbrokenDevices": true,
     "osMinimumVersion": "13.0",
     "osMaximumVersion": null,
     "minAndroidSecurityPatchLevel": null,
     "storageRequireEncryption": true,
     "securityRequireSafetyNetAttestationBasicIntegrity": false,
     "securityRequireSafetyNetAttestationCertifiedDevice": false,
     "securityRequireGooglePlayServices": false,
     "securityRequireUpToDateSecurityProviders": false,
     "securityRequireCompanyPortalAppIntegrity": false,
     "securityRequiredAndroidSafetyNetEvaluationType": "basic",
     "scheduledActionsForRule": [
          {
               "ruleName": null,
               "scheduledActionConfigurations": [
                    {
                         "gracePeriodHours": 0,
                         "actionType": "block",
                         "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                         "notificationMessageCCList": []
                    }
               ]
          }
     ]
}