{
     "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
     "roleScopeTagIds": [
          "Default"
     ],
     "description": null,
     "displayName": "POC_MAC_U_BYOD_SBL_MSZT_DeviceCompliance",
     "passwordRequired": true,
     "passwordBlockSimple": true,
     "passwordExpirationDays": null,
     "passwordMinimumLength": 6,
     "passwordMinutesOfInactivityBeforeLock": 5,
     "passwordPreviousPasswordBlockCount": 24,
     "passwordMinimumCharacterSetCount": null,
     "passwordRequiredType": "numeric",
     "osMinimumVersion": "14.0.0",
     "osMaximumVersion": null,
     "osMinimumBuildVersion": null,
     "osMaximumBuildVersion": null,
     "systemIntegrityProtectionEnabled": true,
     "deviceThreatProtectionEnabled": false,
     "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
     "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
     "storageRequireEncryption": false,
     "gatekeeperAllowedAppSource": "macAppStore",
     "firewallEnabled": true,
     "firewallBlockAllIncoming": true,
     "firewallEnableStealthMode": true,
     "scheduledActionsForRule": [
          {
               "ruleName": null,
               "scheduledActionConfigurations": [
                    {
                         "gracePeriodHours": 0,
                         "actionType": "block",
                         "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                         "notificationMessageCCList": []
                    }
               ]
          }
     ],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none"
               }
          }
     ]
}