{
     "displayName": "POC_WIN_U_BYOD_Alert",
     "description": null,
     "defaultLocale": "en-gb",
     "brandingOptions": "includeCompanyLogo,includeCompanyName,includeContactInformation,includeCompanyPortalLink",
     "roleScopeTagIds": [
          "Default"
     ],
     "localizedNotificationMessages@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/notificationMessageTemplates('87616e5d-e7fc-4739-ac1d-397862ac316c')/localizedNotificationMessages",
     "localizedNotificationMessages": [
          {
               "locale": "en-gb",
               "subject": "Windows Device {{DeviceName}} Non-Compliance Notification",
               "messageTemplate": "Hi {{UserName}}, \n\nYour personal Windows device with name {{DeviceName}} running {{OSAndVersion}} has been marked as non-compliant and will be blocked from accessing Microsoft Services.\n\nPlease update your device, enable the firewall and enable or install an antivirus product.",
               "isDefault": true
          }
     ]
}