{
     "@odata.type": "#microsoft.graph.iosManagedAppProtection",
     "displayName": "POC_IOS_U_SBL_MSZT_AppProtection",
     "description": "",
     "roleScopeTagIds": [
          "Default"
     ],
     "periodOfflineBeforeAccessCheck": "P1D",
     "periodOnlineBeforeAccessCheck": "PT15M",
     "allowedInboundDataTransferSources": "allApps",
     "allowedOutboundDataTransferDestinations": "managedApps",
     "organizationalCredentialsRequired": false,
     "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
     "dataBackupBlocked": true,
     "deviceComplianceRequired": true,
     "managedBrowserToOpenLinksRequired": true,
     "saveAsBlocked": true,
     "periodOfflineBeforeWipeIsEnforced": "P90D",
     "pinRequired": true,
     "maximumPinRetries": 5,
     "simplePinBlocked": true,
     "minimumPinLength": 6,
     "pinCharacterSet": "numeric",
     "periodBeforePinReset": "PT0S",
     "allowedDataStorageLocations": [
          "oneDriveForBusiness",
          "sharePoint"
     ],
     "contactSyncBlocked": true,
     "printBlocked": true,
     "fingerprintBlocked": false,
     "disableAppPinIfDevicePinIsSet": false,
     "maximumRequiredOsVersion": null,
     "maximumWarningOsVersion": null,
     "maximumWipeOsVersion": null,
     "minimumRequiredOsVersion": "18.0.0",
     "minimumWarningOsVersion": null,
     "minimumRequiredAppVersion": null,
     "minimumWarningAppVersion": null,
     "minimumWipeOsVersion": null,
     "minimumWipeAppVersion": null,
     "appActionIfDeviceComplianceRequired": "block",
     "appActionIfMaximumPinRetriesExceeded": "block",
     "pinRequiredInsteadOfBiometricTimeout": null,
     "allowedOutboundClipboardSharingExceptionLength": 0,
     "notificationRestriction": "blockOrganizationalData",
     "previousPinBlockCount": 0,
     "managedBrowser": "microsoftEdge",
     "maximumAllowedDeviceThreatLevel": "notConfigured",
     "mobileThreatDefenseRemediationAction": "block",
     "mobileThreatDefensePartnerPriority": null,
     "blockDataIngestionIntoOrganizationDocuments": false,
     "allowedDataIngestionLocations": [
          "oneDriveForBusiness",
          "sharePoint",
          "camera",
          "photoLibrary"
     ],
     "appActionIfUnableToAuthenticateUser": "block",
     "dialerRestrictionLevel": "allApps",
     "gracePeriodToBlockAppsDuringOffClockHours": null,
     "protectedMessagingRedirectAppType": "anyApp",
     "targetedAppManagementLevels": "unspecified",
     "appGroupType": "allApps",
     "genmojiConfigurationState": "blocked",
     "screenCaptureConfigurationState": "blocked",
     "writingToolsConfigurationState": "blocked",
     "appDataEncryptionType": "whenDeviceLocked",
     "minimumRequiredSdkVersion": null,
     "faceIdBlocked": false,
     "allowWidgetContentSync": true,
     "minimumWipeSdkVersion": null,
     "allowedIosDeviceModels": null,
     "appActionIfIosDeviceModelNotAllowed": "block",
     "appActionIfAccountIsClockedOut": null,
     "thirdPartyKeyboardsBlocked": false,
     "filterOpenInToOnlyManagedApps": false,
     "disableProtectionOfManagedOutboundOpenInData": false,
     "protectInboundDataFromUnknownSources": false,
     "customBrowserProtocol": "",
     "customDialerAppProtocol": "",
     "managedUniversalLinks": [
          "http://*.appsplatform.us/*",
          "http://*.onedrive.com/*",
          "http://*.powerapps.cn/*",
          "http://*.powerapps.com/*",
          "http://*.powerapps.us/*",
          "http://*.powerbi.com/*",
          "http://*.service-now.com/*",
          "http://*.sharepoint-df.com/*",
          "http://*.sharepoint.com/*",
          "http://*.yammer.com/*",
          "http://*.zoom.us/*",
          "http://*collab.apps.mil/l/*",
          "http://*devspaces.skype.com/l/*",
          "http://*teams-fl.microsoft.com/l/*",
          "http://*teams.live.com/l/*",
          "http://*teams.microsoft.com/l/*",
          "http://*teams.microsoft.us/l/*",
          "http://app.powerbi.cn/*",
          "http://app.powerbi.de/*",
          "http://app.powerbigov.us/*",
          "http://msit.microsoftstream.com/video/*",
          "http://tasks.office.com/*",
          "http://to-do.microsoft.com/sharing*",
          "http://web.microsoftstream.com/video/*",
          "http://zoom.us/*",
          "https://*.appsplatform.us/*",
          "https://*.onedrive.com/*",
          "https://*.powerapps.cn/*",
          "https://*.powerapps.com/*",
          "https://*.powerapps.us/*",
          "https://*.powerbi.com/*",
          "https://*.service-now.com/*",
          "https://*.sharepoint-df.com/*",
          "https://*.sharepoint.com/*",
          "https://*.yammer.com/*",
          "https://*.zoom.us/*",
          "https://*collab.apps.mil/l/*",
          "https://*devspaces.skype.com/l/*",
          "https://*teams-fl.microsoft.com/l/*",
          "https://*teams.live.com/l/*",
          "https://*teams.microsoft.com/l/*",
          "https://*teams.microsoft.us/l/*",
          "https://app.powerbi.cn/*",
          "https://app.powerbi.de/*",
          "https://app.powerbigov.us/*",
          "https://msit.microsoftstream.com/video/*",
          "https://tasks.office.com/*",
          "https://to-do.microsoft.com/sharing*",
          "https://web.microsoftstream.com/video/*",
          "https://zoom.us/*"
     ],
     "exemptedUniversalLinks": [
          "http://facetime.apple.com",
          "http://maps.apple.com",
          "https://facetime.apple.com",
          "https://maps.apple.com"
     ],
     "minimumWarningSdkVersion": null,
     "messagingRedirectAppUrlScheme": "",
     "exemptedAppProtocols": [
          {
               "name": "Default",
               "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
          }
     ]
}