{
     "@odata.type": "#microsoft.graph.androidManagedAppProtection",
     "displayName": "POC_AND_U_SBL_MSZT_AppProtection",
     "description": "",
     "roleScopeTagIds": [
          "Default"
     ],
     "periodOfflineBeforeAccessCheck": "P1D",
     "periodOnlineBeforeAccessCheck": "PT15M",
     "allowedInboundDataTransferSources": "allApps",
     "allowedOutboundDataTransferDestinations": "managedApps",
     "organizationalCredentialsRequired": false,
     "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
     "dataBackupBlocked": true,
     "deviceComplianceRequired": true,
     "managedBrowserToOpenLinksRequired": true,
     "saveAsBlocked": true,
     "periodOfflineBeforeWipeIsEnforced": "P90D",
     "pinRequired": true,
     "maximumPinRetries": 5,
     "simplePinBlocked": true,
     "minimumPinLength": 6,
     "pinCharacterSet": "numeric",
     "periodBeforePinReset": "PT0S",
     "allowedDataStorageLocations": [
          "oneDriveForBusiness",
          "sharePoint"
     ],
     "contactSyncBlocked": true,
     "printBlocked": true,
     "fingerprintBlocked": false,
     "disableAppPinIfDevicePinIsSet": false,
     "maximumRequiredOsVersion": null,
     "maximumWarningOsVersion": null,
     "maximumWipeOsVersion": null,
     "minimumRequiredOsVersion": null,
     "minimumWarningOsVersion": null,
     "minimumRequiredAppVersion": null,
     "minimumWarningAppVersion": null,
     "minimumWipeOsVersion": "13.0.0",
     "minimumWipeAppVersion": null,
     "appActionIfDeviceComplianceRequired": "block",
     "appActionIfMaximumPinRetriesExceeded": "block",
     "pinRequiredInsteadOfBiometricTimeout": null,
     "allowedOutboundClipboardSharingExceptionLength": 0,
     "notificationRestriction": "blockOrganizationalData",
     "previousPinBlockCount": 24,
     "managedBrowser": "microsoftEdge",
     "maximumAllowedDeviceThreatLevel": "notConfigured",
     "mobileThreatDefenseRemediationAction": "block",
     "mobileThreatDefensePartnerPriority": null,
     "blockDataIngestionIntoOrganizationDocuments": false,
     "allowedDataIngestionLocations": [
          "oneDriveForBusiness",
          "sharePoint",
          "camera",
          "photoLibrary"
     ],
     "appActionIfUnableToAuthenticateUser": "block",
     "dialerRestrictionLevel": "allApps",
     "gracePeriodToBlockAppsDuringOffClockHours": null,
     "protectedMessagingRedirectAppType": "anyApp",
     "targetedAppManagementLevels": "unspecified",
     "appGroupType": "allApps",
     "screenCaptureBlocked": true,
     "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
     "encryptAppData": true,
     "minimumRequiredPatchVersion": "0000-00-00",
     "minimumWarningPatchVersion": "0000-00-00",
     "minimumWipePatchVersion": "0000-00-00",
     "allowedAndroidDeviceManufacturers": null,
     "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
     "appActionIfAccountIsClockedOut": null,
     "appActionIfSamsungKnoxAttestationRequired": "blockWhenSettingIsSupported",
     "requiredAndroidSafetyNetDeviceAttestationType": "none",
     "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
     "requiredAndroidSafetyNetAppsVerificationType": "none",
     "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
     "customBrowserPackageId": "",
     "customBrowserDisplayName": "",
     "minimumRequiredCompanyPortalVersion": null,
     "minimumWarningCompanyPortalVersion": null,
     "minimumWipeCompanyPortalVersion": null,
     "keyboardsRestricted": false,
     "allowedAndroidDeviceModels": [],
     "appActionIfAndroidDeviceModelNotAllowed": "block",
     "customDialerAppPackageId": "",
     "customDialerAppDisplayName": "",
     "biometricAuthenticationBlocked": false,
     "requiredAndroidSafetyNetEvaluationType": "basic",
     "blockAfterCompanyPortalUpdateDeferralInDays": 0,
     "warnAfterCompanyPortalUpdateDeferralInDays": 0,
     "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
     "deviceLockRequired": false,
     "appActionIfDeviceLockNotSet": "block",
     "connectToVpnOnLaunch": false,
     "appActionIfDevicePasscodeComplexityLessThanLow": null,
     "appActionIfDevicePasscodeComplexityLessThanMedium": null,
     "appActionIfDevicePasscodeComplexityLessThanHigh": null,
     "requireClass3Biometrics": true,
     "requirePinAfterBiometricChange": false,
     "fingerprintAndBiometricEnabled": true,
     "messagingRedirectAppPackageId": "",
     "messagingRedirectAppDisplayName": "",
     "exemptedAppPackages": [],
     "approvedKeyboards": [],
     "assignments": [
          {
               "source": "direct",
               "target": {
                    "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                    "deviceAndAppManagementAssignmentFilterId": null,
                    "deviceAndAppManagementAssignmentFilterType": "none",
                    "groupName": "[SWC] - Intune-Users",
                    "groupType": "DynamicMembership",
                    "membershipRule": "(user.assignedPlans -any (assignedPlan.servicePlanId -eq \"c1ec4a95-1f05-45b3-a911-aa3fa01094f5\" -and assignedPlan.capabilityStatus -eq \"Enabled\")) and (user.accountEnabled -eq true)"
               }
          }
     ]
}